//
//  DataThemes.swift
//  Concentration
//
//  Created by Максим Чесников on 14.01.2020.
//  Copyright © 2020 Максим Чесников. All rights reserved.
//

import Foundation

class DataThemes
{
    var emojiChoies = [["🎃","🤡","☠️","👻","👽","💀","👾","👿","🤖"],["😀","😄","😅","😂","😍","😘","😎","😡","🥶"],["👍","👎","🤙","🤘","🙌","👆","👇","🙏","✊"],
        ["🐶","🐱","🐭","🐹","🐰","🦊","🐻","🐼","🦁"],
        ["🍏","🍎","🍐","🍊","🍋","🍌","🍉","🍇","🥝"],
        ["⚽️","🏀","🏈","⚾️","🥎","🎾","🏐","🎱","🏒"],
        ["🚗","🚕","🚙","🚌","🚎","🏎","🚓","🚑","🚒"],
        ["⌚️","📱","💻","🖥","🖨","📷","🎥","💡","📺"],
        ["🏳️","🏴","🇬🇳","🇬🇼","🇬🇬","🇬🇪","🏴󠁧󠁢󠁥󠁮󠁧󠁿","🇸🇰","🇸🇮"],]
    
    

    func getEmojiForInt(index: Int) -> [String]
    {
        return emojiChoies[index]
    }
    init()
    {
        
    }
}
